In [1]:
1

1

In [2]:
import pandas as pd
import pathlib

csv_path = pathlib.Path(r'C:\Users\user\Desktop\div\data\state-abbrevs.csv')
abbrevs = pd.read_csv(csv_path)
pop = pd.read_csv(csv_path.parent/'state-population.csv')
areas = pd.read_csv(csv_path.parent/'state-areas.csv')

In [15]:
df_merge_areas = pd.merge(areas, abbrevs, on='state', how='outer')
print(df_merge_areas.shape)
df_merge_areas.head(3)

(52, 3)

     state  area (sq. mi) abbreviation
0  Alabama          52423           AL
1   Alaska         656425           AK
2  Arizona         114006           AZ

In [35]:
mask_year = pop['year'] == 2013
mask_ages = pop['ages'] == 'total'
pop_yeni = pop[mask_year & mask_ages].reset_index(drop=True)
pop_yeni

   state/region   ages  year   population
0            AL  total  2013    4833722.0
1            AK  total  2013     735132.0
2            AZ  total  2013    6626624.0
3            AR  total  2013    2959373.0
4            CA  total  2013   38332521.0
5            CO  total  2013    5268367.0
6            CT  total  2013    3596080.0
7            DE  total  2013     925749.0
8            DC  total  2013     646449.0
9            FL  total  2013   19552860.0
10           GA  total  2013    9992167.0
11           HI  total  2013    1404054.0
12           ID  total  2013    1612136.0
13           IL  total  2013   12882135.0
14           IN  total  2013    6570902.0
15           IA  total  2013    3090416.0
16           KS  total  2013    2893957.0
17           KY  total  2013    4395295.0
18           LA  total  2013    4625470.0
19           ME  total  2013    1328302.0
20           MD  total  2013    5928814.0
21           MA  total  2013    6692824.0
22           MI  total  2013    9895622.0
23           MN  total  2013    5420380.0
24           MS  total  2013    2991207.0
25           MO  total  2013    6044171.0
26           MT  total  2013    1015165.0
27           NE  total  2013    1868516.0
28           NV  total  2013    2790136.0
29           NH  total  2013    1323459.0
30           NJ  total  2013    8899339.0
31           NM  total  2013    2085287.0
32           NY  total  2013   19651127.0
33           NC  total  2013    9848060.0
34           ND  total  2013     723393.0
35           OH  total  2013   11570808.0
36           OK  total  2013    3850568.0
37           OR  total  2013    3930065.0
38           PA  total  2013   12773801.0
39           RI  total  2013    1051511.0
40           SC  total  2013    4774839.0
41           SD  total  2013     844877.0
42           TN  total  2013    6495978.0
43           TX  total  2013   26448193.0
44           UT  total  2013    2900872.0
45           VT  total  2013     626630.0
46           VA  total  2013    8260405.0
47           WA  total  2013    6971406.0
48           WV  total  2013    1854304.0
49           WI  total  2013    5742713.0
50           WY  total  2013     582658.0
51           PR  total  2013    3615086.0
52          USA  total  2013  316128839.0

In [41]:
df_merge_areas.head(3)

     state  area (sq. mi) abbreviation
0  Alabama          52423           AL
1   Alaska         656425           AK
2  Arizona         114006           AZ

In [42]:
pop_yeni.head(3)

  state/region   ages  year  population
0           AL  total  2013   4833722.0
1           AK  total  2013    735132.0
2           AZ  total  2013   6626624.0

In [49]:
pd.merge(
    df_merge_areas, pop_yeni, 
    left_on='abbreviation', 
    right_on='state/region', 
    how='right').drop(['state/region', 'ages', 'year'], axis='columns')

                   state  area (sq. mi) abbreviation   population
0                Alabama        52423.0           AL    4833722.0
1                 Alaska       656425.0           AK     735132.0
2                Arizona       114006.0           AZ    6626624.0
3               Arkansas        53182.0           AR    2959373.0
4             California       163707.0           CA   38332521.0
5               Colorado       104100.0           CO    5268367.0
6            Connecticut         5544.0           CT    3596080.0
7               Delaware         1954.0           DE     925749.0
8   District of Columbia           68.0           DC     646449.0
9                Florida        65758.0           FL   19552860.0
10               Georgia        59441.0           GA    9992167.0
11                Hawaii        10932.0           HI    1404054.0
12                 Idaho        83574.0           ID    1612136.0
13              Illinois        57918.0           IL   12882135.0
14               Indiana        36420.0           IN    6570902.0
15                  Iowa        56276.0           IA    3090416.0
16                Kansas        82282.0           KS    2893957.0
17              Kentucky        40411.0           KY    4395295.0
18             Louisiana        51843.0           LA    4625470.0
19                 Maine        35387.0           ME    1328302.0
20              Maryland        12407.0           MD    5928814.0
21         Massachusetts        10555.0           MA    6692824.0
22              Michigan        96810.0           MI    9895622.0
23             Minnesota        86943.0           MN    5420380.0
24           Mississippi        48434.0           MS    2991207.0
25              Missouri        69709.0           MO    6044171.0
26               Montana       147046.0           MT    1015165.0
27              Nebraska        77358.0           NE    1868516.0
28                Nevada       110567.0           NV    2790136.0
29         New Hampshire         9351.0           NH    1323459.0
30            New Jersey         8722.0           NJ    8899339.0
31            New Mexico       121593.0           NM    2085287.0
32              New York        54475.0           NY   19651127.0
33        North Carolina        53821.0           NC    9848060.0
34          North Dakota        70704.0           ND     723393.0
35                  Ohio        44828.0           OH   11570808.0
36              Oklahoma        69903.0           OK    3850568.0
37                Oregon        98386.0           OR    3930065.0
38          Pennsylvania        46058.0           PA   12773801.0
39          Rhode Island         1545.0           RI    1051511.0
40        South Carolina        32007.0           SC    4774839.0
41          South Dakota        77121.0           SD     844877.0
42             Tennessee        42146.0           TN    6495978.0
43                 Texas       268601.0           TX   26448193.0
44                  Utah        84904.0           UT    2900872.0
45               Vermont         9615.0           VT     626630.0
46              Virginia        42769.0           VA    8260405.0
47            Washington        71303.0           WA    6971406.0
48         West Virginia        24231.0           WV    1854304.0
49             Wisconsin        65503.0           WI    5742713.0
50               Wyoming        97818.0           WY     582658.0
51                   NaN            NaN          NaN    3615086.0
52                   NaN            NaN          NaN  316128839.0

In [40]:
df_merge_pop = pd.merge(pop_yeni, 
                        abbrevs, 
                        left_on='state/region', 
                        right_on='abbreviation',
                        how='left').drop('state/region', axis='columns')
df_merge_pop

     ages  year   population                 state abbreviation
0   total  2013    4833722.0               Alabama           AL
1   total  2013     735132.0                Alaska           AK
2   total  2013    6626624.0               Arizona           AZ
3   total  2013    2959373.0              Arkansas           AR
4   total  2013   38332521.0            California           CA
5   total  2013    5268367.0              Colorado           CO
6   total  2013    3596080.0           Connecticut           CT
7   total  2013     925749.0              Delaware           DE
8   total  2013     646449.0  District of Columbia           DC
9   total  2013   19552860.0               Florida           FL
10  total  2013    9992167.0               Georgia           GA
11  total  2013    1404054.0                Hawaii           HI
12  total  2013    1612136.0                 Idaho           ID
13  total  2013   12882135.0              Illinois           IL
14  total  2013    6570902.0               Indiana           IN
15  total  2013    3090416.0                  Iowa           IA
16  total  2013    2893957.0                Kansas           KS
17  total  2013    4395295.0              Kentucky           KY
18  total  2013    4625470.0             Louisiana           LA
19  total  2013    1328302.0                 Maine           ME
20  total  2013    5928814.0              Maryland           MD
21  total  2013    6692824.0         Massachusetts           MA
22  total  2013    9895622.0              Michigan           MI
23  total  2013    5420380.0             Minnesota           MN
24  total  2013    2991207.0           Mississippi           MS
25  total  2013    6044171.0              Missouri           MO
26  total  2013    1015165.0               Montana           MT
27  total  2013    1868516.0              Nebraska           NE
28  total  2013    2790136.0                Nevada           NV
29  total  2013    1323459.0         New Hampshire           NH
30  total  2013    8899339.0            New Jersey           NJ
31  total  2013    2085287.0            New Mexico           NM
32  total  2013   19651127.0              New York           NY
33  total  2013    9848060.0        North Carolina           NC
34  total  2013     723393.0          North Dakota           ND
35  total  2013   11570808.0                  Ohio           OH
36  total  2013    3850568.0              Oklahoma           OK
37  total  2013    3930065.0                Oregon           OR
38  total  2013   12773801.0          Pennsylvania           PA
39  total  2013    1051511.0          Rhode Island           RI
40  total  2013    4774839.0        South Carolina           SC
41  total  2013     844877.0          South Dakota           SD
42  total  2013    6495978.0             Tennessee           TN
43  total  2013   26448193.0                 Texas           TX
44  total  2013    2900872.0                  Utah           UT
45  total  2013     626630.0               Vermont           VT
46  total  2013    8260405.0              Virginia           VA
47  total  2013    6971406.0            Washington           WA
48  total  2013    1854304.0         West Virginia           WV
49  total  2013    5742713.0             Wisconsin           WI
50  total  2013     582658.0               Wyoming           WY
51  total  2013    3615086.0                   NaN          NaN
52  total  2013  316128839.0                   NaN          NaN

In [ ]:
pd.merge(
    df_merge_pop, 
    df_merge_areas, 
    on='abbreviation', 
    how='left'
    )

,ages,year,population,state_x,abbreviation,state_y,area (sq. mi)
0,under18,2012,1117489.0,Alabama,AL,Alabama,52423
1,total,2012,4817528.0,Alabama,AL,Alabama,52423
2,under18,2010,1130966.0,Alabama,AL,Alabama,52423
3,total,2010,4785570.0,Alabama,AL,Alabama,52423
4,under18,2011,1125763.0,Alabama,AL,Alabama,52423
...,...,...,...,...,...,...,...
2539,total,2010,309326295.0,NaN,NaN,Puerto Rico,3515
2540,under18,2011,73902222.0,NaN,NaN,Puerto Rico,3515
2541,total,2011,311582564.0,NaN,NaN,Puerto Rico,3515
2542,under18,2012,73708179.0,NaN,NaN,Puerto Rico,3515
2543,total,2012,313873685.0,NaN,NaN,Puerto Rico,3515

In [5]:
s1 = pd.Series(['rtma', 'xash', 'piti'], index=['sh', 't', 'e'], name='yemek'
               ).to_frame()
s2 = pd.Series(['goy', 'yashil', 'qara'], index=['sh', 't', ''], name='reng'
               ).to_frame()
s1

       yemek
sh  rtma
t       xash
e       piti

In [6]:
s2

      reng
sh     goy
t   yashil
     qara

In [12]:
pd.merge(s1, s2, left_index=True, right_index=True, how='left')

       yemek    reng
sh  rtma     goy
t       xash  yashil
e       piti     NaN

In [ ]:
c1 = pd.DataFrame()

In [60]:
birth_path = pathlib.Path(r'C:\Users\user\Desktop\div\data\births.csv')
birth = pd.read_csv(birth_path)
birth.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [73]:
# birth.groupby('year')['births'].sum()
# birth.groupby('gender')['births'].sum()
# birth.groupby(['year', 'gender'])['births'].sum()
# birth.groupby(['year', 'month'])['births'].sum()
il_ay = birth.groupby(['year', 'month'], as_index=False)['births'].sum()
il_ay.groupby(['month'])['births'].mean()

month
1     309104.925
2     288529.450
3     316971.100
4     302147.275
5     315624.300
6     313026.750
7     334188.900
8     338200.175
9     331320.775
10    323873.750
11    304949.175
12    316422.875
Name: births, dtype: float64

In [54]:
df = pd.DataFrame({
    'key': ['A', 'B', 'C', 'A', 'B', 'C'],
    'data': range(1,7)
    })

df

  key  data
0   A     1
1   B     2
2   C     3
3   A     4
4   B     5
5   C     6

In [77]:
rng = np.random.RandomState(0)
df = pd.DataFrame({
    'key': ['A', 'B', 'C', 'A', 'B', 'C'],
    'data1': range(6),
    'data2': rng.randint(0, 10, 6)
    })
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [83]:
df.groupby('key')['data1'].sum()
df.groupby('key').agg({
    'data1' : 'sum',
    'data2' : 'mean',
})
df.groupby('key').agg(
    data_sum = ('data1', 'sum'),
    data_mean = ('data2', 'mean')
)

     data_sum  data_mean
key
A           3        4.0
B           5        3.5
C           7        6.0